# IsPanelScheduleTemplate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..IsPanelScheduleTemplate Method
PanelScheduleView Class See Also
---
Check if this is a panel schedule template.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsPanelScheduleTemplate()
```

Visual Basic
---
```text
Public Function IsPanelScheduleTemplate As Boolean
```

Visual C++
---
```text
public:
bool IsPanelScheduleTemplate()
```

# ### Return Value
Check if this is a panel schedule template.
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace